title: Schtasks.exe execution VBScript if parent process is a browser
id: na
status: test
description: A JavaScript command was also executed, which created a scheduled task to execute chfeeds.vbe multiple times a day.
author: renatocraf
date: 2022/10/25
references:
   - https://www.mandiant.com/resources/blog/apt33-insights-into-iranian-cyber-espionage
   - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/elfin-apt33-espionage
   - https://www.microsoft.com/en-us/security/blog/2020/06/18/inside-microsoft-threat-protection-mapping-attack-chains-from-cloud-to-endpoint/
   - https://www.mandiant.com/resources/blog/overruled-containing-a-potentially-destructive-adversary
logsource:
   category: process_creation
   product: windows   
detection:
    selection:
        ParentCommandLine|contains: 
            - '\iexplore.exe'
            - '\firefox.exe'
            - '\chrome.exe'
            - '\opera.exe'
        CommandLine|contains:
            - 'schtasks.exe'
    selection2:
        CommandLine|contains:
            - '.vbe'
            - '.vbs'
    condition: selection and selection2
fields: 
   - CommandLine
   - ParentCommandLine
falsepositives:
   - Unknown
level: medium
tags:
   - attack.persistence
   - attack.t1053.005
   - attack.t1566.002
   - attack.g0064
